{
    "replace_job_title": true,
    "rewrite_bullets": true,
    "resume_path": "all resumes/default/resume.docx",
    "job_id": "12345",
    "first_name": "Danny",
    "last_name": "Basavaraju",
    "job_title": "Full Stack Java / React Developer",
    "job_description": "Full Stack Java / React Developer\nAlpharetta, Georgia, United States of America\n\nApply Now\n\nFind out how well you match with this job\n\nUpload your resume\n\nJob description\nEmployment Type\nFull time\nJob Level\nProfessional\nPosted Date\nMay 20, 2025\nIn the Technology division, we leverage innovation to build the connections and capabilities that power our Firm, enabling our clients and colleagues to redefine markets and shape the future of our communities. This is a Software Engineering III position at the Director level, which is part of the job family responsible for developing and maintaining software solutions that support business needs.\n\nMorgan Stanley is an industry leader in financial services, known for mobilizing capital to help governments, corporations, institutions, and individuals around the world achieve their financial goals.\n\nInterested in joining a team that’s eager to create, innovate and make an impact on the world? Read on.\n\nMorgan Stanley Wealth Management (MSWM) Technology is the global technology department responsible for the design, development, delivery, and support of the technical solutions behind the products and services used by the Morgan Stanley Wealth Management (MSWM) business. The department is comprised of 10 organizations: Sales, Banking & Corporate-Client Technology, Investment Products & Markets Technology, Client Reporting, Core Processing, Private and International Wealth Management Technology, Technology Integration Office, Enterprise Infrastructure & Production Management, Capital Markets Application & Data Services, Deployment Planning & Release Management, and the Chief Operating Office.\n\nServices Tech department is responsible for creating innovative solutions for the service teams providing support and tools such as CRM system, IVR and bot technology needed for servicing the clients that reach to customer service & operations groups.\n\nAs part of strategy to design and implement industry leading applications Morgan Stanley services tech team is looking for a Java developer with good experience on UI/UX technologies to join a technologically advanced team. Candidate must have expertise in leading design and development of multi-tiered Java/React applications. Candidate should be fluent in spring, databases, and database interface layers and associated Java development tools. Candidate will interface on a regular basis with other teams including other internal IT teams across Wealth Management, BA team, QA team, and global development team. To be successful, the role will require the individual to understand the CRM technology landscape, and to offer creative solutions that integrate current capabilities, vendor capabilities, proprietary system builds, and the ability to adapt to changing business requirements.\n\nWhat you’ll bring to the role:\n\nBachelor's degree (pref. Computer Science or related degree) with 5+ years of hands-on experience in JAVA/Unix environment.\n\nExpertise in Java Web Services & API design.\n\nFamiliar with JDBC and JPA/Hibernate, relational DB principles using Structured Query Language (SQL)\n\nExpert level experience in UI developments with React JS\n\nHands-on experience with Bootstrap and responsive design.\n\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery.\n\nExperience in CRM/Salesforce would be added benefits.\n\nMust have Agile/Scrum methodologies experience.\n\nKnowledge of C/C++ is a plus.\n\nDesired Skills\n\nBackground in Banking/Financial Services.\n\nMust be able to quickly learn and be hands-on, understanding complexity and ins-and-outs of systems the candidate is aligned to, as well as size/scope and impact of projects to these systems.\n\nWHAT YOU CAN EXPECT FROM MORGAN STANLEY:\n\nWe are committed to maintaining the first-class service and high standard of excellence that have defined Morgan Stanley for over 89 years. Our values - putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back - aren’t just beliefs, they guide the decisions we make every day to do what’s best for our clients, communities and more than 80,000 employees in 1,200 offices across 42 countries. At Morgan Stanley, you’ll find an opportunity to work alongside the best and the brightest, in an environment where you are supported and empowered. Our teams are relentless collaborators and creative thinkers, fueled by their diverse backgrounds and experiences. We are proud to support our employees and their families at every point along their work-life journey, offering some of the most attractive and comprehensive employee benefits and perks in the industry. There’s also ample opportunity to move about the business for those who show passion and grit in their work.\n\nMorgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.\n\nIt is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.\n\nMorgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet)."
}